{
  "version": "1.0",
  "game": "Coffin Canyon",
  "rules": [
{
  "version": "6.1",
  "last_updated": "01-10-26",
  "changelog": "Cleaned for faction builder consistency. Standardized formatting, removed duplicates, clarified ability structure.",
  "abilities": [
    {
      "name": "Aim",
      "cost": 0,
      "effect": "This unit may sacrifice movement to gain +1 die on its next ranged attack. Declare before rolling."
    },
    {
      "name": "Ambush",
      "cost": 0,
      "effect": "May deploy hidden. Reveal at any time to gain first strike in melee"
    },
    {
      "name": "Anchor",
      "cost": 0,
      "effect": "Cannot be moved by enemy abilities or effects. Ignores knockback and displacement"
    },
    {
      "name": "Assistant",
      "cost": 0,
      "effect": "May assist adjacent Mystic or Scientist with special activations"
    },
    {
      "name": "Audio Suppression",
      "cost": 2,
      "effect": "Enemies within 6\" suffer -1 to Morale checks"
    },
    {
      "name": "Authority",
      "cost": 3,
      "effect": "Friendly units within 6\" ignore Suppression effects"
    },
    {
      "name": "Backstab",
      "cost": 0,
      "effect": "When attacking a target that is already engaged with another friendly unit, this unit deals +1 damage on successful hits."
    },
    {
      "name": "Barely Controlled",
      "cost": 0,
      "effect": "At the start of its activation, this unit must move at least 6\". If it cannot, or chooses not to, it must pass a Quality test or immediately Crash Land."
    },
    {
      "name": "Befriend",
      "cost": 0,
      "effect": "Action. A Ranger may attempt to Befriend a neutral or uncontrolled creature they are trained to interact with (based on Monster Type). Target must be in base contact. Make an opposed Quality check: both Ranger and creature roll a number of dice equal to their current Quality; each 4+ is a success. If the Ranger scores more successes, the creature becomes Befriended. If the creature scores more successes, the attempt fails with no effect. On a tie, the creature becomes Wary. Befriended creatures will not attack Rangers and may be escorted within 6\". Befriended creatures never fight for Rangers unless explicitly stated. Some scenarios award Victory Points for escorting Befriended creatures to extraction. Peerless creatures follow their own rules and may not be Befriended unless explicitly stated."
    },
    {
      "name": "Befriend Automat",
      "cost": 0,
      "effect": "May attempt Befriend actions against Automat constructs. Success enables control or neutrality per scenario rules."
    },
    {
      "name": "Befriend Beasts",
      "cost": 0,
      "effect": "May attempt Befriend actions against Beasts. Successful Befriend prevents hostility per scenario rules."
    },
    {
      "name": "Befriend Bloodless",
      "cost": 0,
      "effect": "May attempt Befriend actions against Bloodless (undead). Successful Befriend alters hostility per scenario rules."
    },
    {
      "name": "Befriend Kaiju",
      "cost": 0,
      "effect": "May attempt Befriend actions against Kaiju-class monsters. Success calms or redirects per scenario rules."
    },
    {
      "name": "Berserk",
      "cost": 0,
      "effect": "At the start of its activation, this model must move as directly as possible toward the nearest visible enemy model, if able. While Berserk: Gain +1 die on melee attacks. Cannot take Interact actions."
    },
    {
      "name": "Binding Rig",
      "cost": 3,
      "effect": "On successful Grapple vs Brute or Monster type: target becomes Restrained (cannot move or attack until adjacent ally breaks restraints or this unit dies)"
    },
    {
      "name": "Blast",
      "cost": 0,
      "effect": "Area of effect attack. Roll separately for each model in blast radius. See weapon for specific radius."
    },
    {
      "name": "Blood in the Air",
      "cost": 0,
      "effect": "When any model within 4\" is reduced to 0 Quality, this model gains +1 die on its next attack."
    },
    {
      "name": "Bloodless",
      "cost": 0,
      "effect": "Immune to Poison and Blood in the Air effects. Cannot be targeted by abilities that specifically affect living creatures."
    },
    {
      "name": "Boardwalk Blitzer",
      "cost": 0,
      "effect": "Moves at double speed on boardwalks. Ignores movement penalties from sand when on boardwalk"
    },
    {
      "name": "Brace",
      "cost": 0,
      "effect": "May sacrifice movement to gain +1 Defense until next activation"
    },
    {
      "name": "Brain Bloom",
      "cost": 0,
      "effect": "Ranged mind attack that ignores cover bonuses. Apply Morale pressure first where applicable"
    },
    {
      "name": "Brutal Blow",
      "cost": 0,
      "effect": "Each successful melee hit deals +1 damage"
    },
    {
      "name": "Cargo Hold",
      "cost": 5,
      "effect": "May transport up to 4 Rangers OR 1 medium Monster OR 2 objectives. Load/unload requires base contact and one activation"
    },
    {
      "name": "Choking Dust",
      "cost": 0,
      "effect": "If this unit's attack hits but deals no damage, target becomes Suppressed until end of its next activation. On natural 6 to hit, Suppressed extends by one additional activation."
    },
    {
      "name": "Climber",
      "cost": 0,
      "effect": "May climb vertical surfaces. Ignores height penalties for movement"
    },
    {
      "name": "Corrode",
      "cost": 0,
      "effect": "On successful melee hit: If target has Mechan flag or is mechanical construct (Iron Golem, Iron Diplomat, etc.), deal 1 automatic damage in addition to normal attack. Otherwise, against targets with metal equipment, choose one - Remove 1 weapon property OR reduce target's Defense by 1 (permanent, minimum 0). Does not affect natural weapons (claws, fangs, etc.) or non-metallic armor. Corroded equipment and mechanical damage can be repaired using REPAIR ability."
    },
    {
      "name": "Crash Landing",
      "cost": 0,
      "effect": "When this unit fails Barely Controlled or is destroyed while Flying, place the model on the table. All units within 3\" suffer 1 automatic hit and are Pinned."
    },
    {
      "name": "Cut and Run",
      "cost": 0,
      "effect": "When targeted by an attack (before dice are rolled), this model may immediately move up to 3\". If it does, it drops any carried item at its original location."
    },
    {
      "name": "Darting Attack",
      "cost": 0,
      "effect": "After shooting, may move up to 3\" even if already moved this activation"
    },
    {
      "name": "Deadeye",
      "cost": 0,
      "effect": "Once per game, this unit may reroll all missed dice on a single ranged attack."
    },
    {
      "name": "Demolition",
      "cost": 0,
      "effect": "Deals double damage to structures and terrain features"
    },
    {
      "name": "Desperate Push",
      "cost": 0,
      "effect": "This model may attempt an action even if it would normally be forbidden (Pinned, Suppressed, or at 0 Move). Roll as normal. If the roll produces no successes, this model loses 1 additional Quality."
    },
    {
      "name": "Dread",
      "cost": 0,
      "effect": "Enemies within 6\" suffer -1 to Morale checks"
    },
    {
      "name": "Extraction Priority",
      "cost": 0,
      "effect": "If this unit exits the table while carrying an objective or Thyr crystal, gain +2 VP (in addition to objective value)."
    },
    {
      "name": "Fast",
      "cost": 0,
      "effect": "+2\" to base movement"
    },
    {
      "name": "Fear 1",
      "cost": 0,
      "effect": "Enemies treat this unit as causing one additional Morale Loss"
    },
    {
      "name": "Fear 2",
      "cost": 0,
      "effect": "Enemies treat this unit as causing two additional Morale Loss"
    },
    {
      "name": "Fear 3",
      "cost": 0,
      "effect": "Enemies treat this unit as causing three additional Morale Loss"
    },
    {
      "name": "Fearless",
      "cost": 0,
      "effect": "Automatically passes all Morale checks. Immune to Fear effects."
    },
    {
      "name": "Field Patch Job",
      "cost": 2,
      "effect": "Adjacent DEVICE or VEHICLE regains 2 Quality (once per activation)"
    },
    {
      "name": "Flechette Drop",
      "cost": 0,
      "effect": "Attack. Once per activation while Flying, place a 6\" diameter circle anywhere this unit moved over this activation. All units inside suffer a ranged attack roll. Cover does not apply."
    },
    {
      "name": "Flying",
      "cost": 0,
      "effect": "This unit ignores terrain while moving and may move over units and obstacles. Cannot be targeted by melee attacks unless the attacker also has Flying or a rule that allows it."
    },
    {
      "name": "Furious",
      "cost": 0,
      "effect": "If this model has lost any Quality, it gains +1 die on its next melee attack. This bonus is cleared after the attack is resolved."
    },
    {
      "name": "Gas Masks",
      "cost": 0,
      "effect": "This unit ignores Choking Dust effects and other environmental gas/smoke/toxic effects as determined by scenario rules."
    },
    {
      "name": "Grapple",
      "cost": 0,
      "effect": "On hit, pull target 3-6\" toward this unit. Target may not move next activation"
    },
    {
      "name": "Grunt",
      "cost": 0,
      "effect": "Expendable unit type. See Expendable Fodder in Type Rules for full effects"
    },
    {
      "name": "Hero",
      "cost": 0,
      "effect": "May reroll one failed action per activation"
    },
    {
      "name": "Heroic Grit",
      "cost": 0,
      "effect": "Once per game: ignore first wound suffered"
    },
    {
      "name": "Hex",
      "cost": 0,
      "effect": "On successful hit, target suffers -1 Quality until end of its next activation"
    },
    {
      "name": "Hold It Together",
      "cost": 0,
      "effect": "When this model would test Morale, it may skip the test. If it does, it loses 1 Quality after the current activation. May not reduce Quality below 3+."
    },
    {
      "name": "Immobile",
      "cost": 0,
      "effect": "Cannot move. Gains +1 Defense when attacked"
    },
    {
      "name": "Impact 1",
      "cost": 0,
      "effect": "When charging into melee, deals 1 automatic hit before normal attack rolls"
    },
    {
      "name": "Impact 2",
      "cost": 0,
      "effect": "When charging, deals 2 automatic hits before combat begins"
    },
    {
      "name": "Impact 3",
      "cost": 0,
      "effect": "When charging, deals 3 automatic hits before combat begins"
    },
    {
      "name": "Inspire",
      "cost": 0,
      "effect": "Friendly units within 6\" gain +1 to Morale checks"
    },
    {
      "name": "Interact",
      "cost": 0,
      "effect": "Can interact with objectives and terrain features. Required to contest or control objectives"
    },
    {
      "name": "Kick the Machine",
      "cost": 2,
      "effect": "Adjacent friendly unit: Remove one debuff (Hex, Stagger, Suppression, Pinned)"
    },
    {
      "name": "Load and Carry",
      "cost": 0,
      "effect": "May pick up and carry objectives, Thyr crystals, or Spare Parts without penalty. Move speed unaffected."
    },
    {
      "name": "Mark Target",
      "cost": 3,
      "effect": "Once per game: Choose one enemy within LoS. That target takes +1 damage from all sources until end of round."
    },
    {
      "name": "Mismanaged Asset",
      "cost": -5,
      "effect": "If this unit is destroyed before Round 4, your faction loses 5 Victory Points"
    },
    {
      "name": "Mobile Cell Block",
      "cost": 5,
      "effect": "Functions as Cargo Hold, but can hold arrested units (Restrained by Binding Rig). When this vehicle extracts off-table with prisoners, score VP equal to prisoners' combined point cost ÷ 10."
    },
    {
      "name": "Mobile Cover",
      "cost": 0,
      "effect": "Adjacent friendlies gain +1 Defense vs ranged attacks"
    },
    {
      "name": "Mobile Dynamo",
      "cost": 0,
      "effect": "Projects 12\" Electromagik field. Hexan and Jäger within field may use abilities. Moving reduces this turn's field to 6\". Counts as Dynamo Generator for Electromagik dependency"
    },
    {
      "name": "Monster and Device",
      "cost": 0,
      "effect": "This unit counts as both MONSTER and DEVICE type for abilities, upgrades, and targeting purposes"
    },
    {
      "name": "Mystic",
      "cost": 0,
      "effect": "Unit type with access to mystical abilities and Unleashed Power power"
    },
    {
      "name": "Overextend",
      "cost": 0,
      "effect": "When this model's attack rolls more successes than required to hit, it may convert one excess success into +1 damage OR +2\" movement after the action. If it does, this model suffers -1 die on its next action."
    },
    {
      "name": "Panic Fire",
      "cost": 0,
      "effect": "When this model is targeted by a melee attack, it may immediately make a ranged attack at -1 die. After resolving the attack, this model must test Morale. May only be used once per round."
    },
    {
      "name": "Pass Judgment",
      "cost": 8,
      "effect": "Once per game, target one enemy unit within 12\". Until end of game, that unit suffers -1 to all Defense rolls and Liberty Corps units may reroll 1s when attacking it."
    },
    {
      "name": "Pierce",
      "cost": 0,
      "effect": "On a natural 6, bypass Defense entirely"
    },
    {
      "name": "Pinning Shot",
      "cost": 0,
      "effect": "On a hit, the target cannot Move during its next activation. This effect does not stack or extend if applied multiple times."
    },
    {
      "name": "Poison",
      "cost": 0,
      "effect": "After dealing damage, target suffers 1 additional damage at end of its next activation"
    },
    {
      "name": "Quick Draw",
      "cost": 0,
      "effect": "May attack first in melee if charged"
    },
    {
      "name": "Random Movement",
      "cost": 0,
      "effect": "At the start of this unit's activation, roll 1d8 or use scatter die to determine direction (1=NE, 2=E, 3=SE, 4=S, 5=SW, 6=W, 7=NW, 8=N), then move up to its Move stat in that direction. Stop if it contacts terrain/units or would move off the board. If forced off board, remove from play (counts as exited/fled)."
    },
    {
      "name": "Regeneration",
      "cost": 0,
      "effect": "At start of activation, heal 1 wound on a 5+"
    },
    {
      "name": "Relentless",
      "cost": 0,
      "effect": "Ignores Pinned status. May always move full distance"
    },
    {
      "name": "Repair",
      "cost": 0,
      "effect": "Action. If this unit has Spare Parts available, it may restore 1 damage to an adjacent friendly vehicle, device, or mechanical unit. This consumes 1 use of Spare Parts. Can also change state from Broken to Functional if applicable."
    },
    {
      "name": "Rolling Fog",
      "cost": 3,
      "effect": "Once per game: Place a Fog marker (3\" radius) within 12\". Fog blocks line of sight and prevents special actions (Hex, Charm, Inspire) from being used through it. Lasts until end of next round."
    },
    {
      "name": "Runner",
      "cost": 1,
      "effect": "May use Run action (double movement) without penalty. May still contest objectives after Running."
    },
    {
      "name": "Scout",
      "cost": 0,
      "effect": "May deploy up to 6\" forward from deployment zone. Gains +1\" to movement on first turn"
    },
    {
      "name": "Shield Aura",
      "cost": 0,
      "effect": "Friendly units within 6\" gain +1 Defense"
    },
    {
      "name": "Shield Wall",
      "cost": 2,
      "effect": "Friendly units within 3\" gain +1 Defense"
    },
    {
      "name": "Signal Orders",
      "cost": 2,
      "effect": "Once per activation: One friendly unit within 12\" may immediately move 3\""
    },
    {
      "name": "Silence",
      "cost": 3,
      "effect": "Main Action. Range 12\". Duration 2 rounds. Create a 12\" radius zone of absolute silence centered on a point within range. While in Silent Zone: No sound can be made or heard, Radios do not function, Audio-based abilities (Inspire, Signal Orders, Rally, Command) cannot be used, Morale tests from Fear at -1 die, Monsters with hearing-based detection cannot sense units."
    },
    {
      "name": "Skittish",
      "cost": 0,
      "effect": "This model must test Morale the first time each round an enemy model enters within 4\"."
    },
    {
      "name": "Slip Away",
      "cost": 0,
      "effect": "May leave melee combat without penalty or free strikes"
    },
    {
      "name": "Sonderbar Injection",
      "cost": 0,
      "effect": "Once per game, with adjacent Chemist Lackey, inject a Plugugly. Roll 1d6: 3-6 grants +2 Quality +1 Defense permanently, 1-2 transforms into enemy Sonderbar Ghoul"
    },
    {
      "name": "Sonic",
      "cost": 0,
      "effect": "Attacks ignore Cover bonuses and can affect targets that are normally immune to physical damage. May cause Blinding/Deafening effects (scenario-specific)."
    },
    {
      "name": "Sonic Nullifier",
      "cost": 2,
      "effect": "Enemy units within 6\" cannot use Hex, Charm, or other Mystic special abilities"
    },
    {
      "name": "Stagger",
      "cost": 0,
      "effect": "On a successful hit, the target loses 1\" of movement and rolls -1 die on its next action. If the target is reduced to 0 Move, it may not Disengage this activation."
    },
    {
      "name": "Steal",
      "cost": 0,
      "effect": "May use Interact action in base contact with enemy unit to attempt theft. On success, choose one: remove one non-Titan upgrade from target (upgrade is destroyed), steal 1 carried resource/token, or apply -1 Defense to target until end of round."
    },
    {
      "name": "Stealth",
      "cost": 0,
      "effect": "Enemies shooting from 9\"+ suffer -1 to hit"
    },
    {
      "name": "Strain",
      "cost": 0,
      "effect": "Using Unleashed Power causes 1 Strain. At 3 Strain, this unit may not use Unleashed Power until Strain is cleared (end of round or special ability)."
    },
    {
      "name": "Suppression",
      "cost": 2,
      "effect": "On a hit, the target rolls -1 die on its next action (attack, ability, or Morale test)."
    },
    {
      "name": "Tough 1",
      "cost": 0,
      "effect": "Roll 1 die when taking damage. On 5+, ignore 1 point of damage."
    },
    {
      "name": "Tough 2",
      "cost": 0,
      "effect": "Reduce incoming damage by 2 (minimum 1)"
    },
    {
      "name": "Tough 3",
      "cost": 0,
      "effect": "Reduce incoming damage by 3 (minimum 1)"
    },
    {
      "name": "Tough 4",
      "cost": 0,
      "effect": "Roll 4 dice when taking damage. On 5+, ignore 1 point of damage per success."
    },
    {
      "name": "Tough 5",
      "cost": 0,
      "effect": "Reduce incoming damage by 5 (minimum 1)"
    },
    {
      "name": "Triage Transfusion",
      "cost": 0,
      "effect": "Action. An adjacent friendly unit gains +1 Quality (to a maximum of its starting Quality). This unit immediately loses 1 Quality."
    },
    {
      "name": "Under Fire",
      "cost": 3,
      "effect": "On successful ranged hit: target is Pinned AND suffers -1 Quality until end of its next activation"
    },
    {
      "name": "Universal Terror",
      "cost": 10,
      "effect": "When this unit fires its weapon: ALL units (friendly AND enemy) within 12\" must test Morale"
    },
    {
      "name": "Unleashed Power",
      "cost": 0,
      "effect": "Ranged magical attack using Wild Magic. Roll on Wild Magic Table (2d6) to determine effect. May cause Strain."
    },
    {
      "name": "Unshakable",
      "cost": 0,
      "effect": "Auto-passes all Morale checks. Ignores Dread effects"
    },
    {
      "name": "Vengeful",
      "cost": 0,
      "effect": "Each time this model loses one or more Quality from an enemy attack, it gains +1 bonus die on its next attack. This bonus stacks if Quality is lost multiple times before attacking, applies to one attack only, is cleared immediately after the attack, and may not increase dice rolled above the model's starting Quality."
    },
    {
      "name": "Venom",
      "cost": 0,
      "effect": "After this unit deals damage in melee, the target suffers 1 additional damage at the end of its next activation unless it is Bloodless or Automat."
    },
    {
      "name": "Vitagood Brew",
      "cost": 0,
      "effect": "Once per game. Action. This unit or an adjacent ally immediately restores 1 lost Quality and removes Suppression or Stagger."
    },
    {
      "name": "Witch Stitching",
      "cost": 0,
      "effect": "First time per activation this unit would lose Quality: 5+ ignore 1 damage"
    },
    {
      "name": "Witch-Stitched Clothing",
      "cost": 0,
      "effect": "+1 Defense. Counts as Light Armor. Does not reduce movement or prevent Flying."
    }
  ],
  "weapon_properties": [
    {
      "name": "AP 1",
      "effect": "Armor Piercing: Ignore 1 point of Defense"
    },
    {
      "name": "AP 2",
      "effect": "Armor Piercing: Ignore 2 points of Defense"
    },
    {
      "name": "AP 3",
      "effect": "Armor Piercing: Ignore 3 points of Defense"
    },
    {
      "name": "Blast 1",
      "effect": "1\" radius area of effect. Roll separately for each model in area"
    },
    {
      "name": "Blast 2",
      "effect": "2\" radius area of effect. Roll separately for each model in area"
    },
    {
      "name": "Blast 3",
      "effect": "3\" radius area of effect. Roll separately for each model in area"
    },
    {
      "name": "Blinding",
      "effect": "On hit: target is Blinded until end of its next activation. While Blinded: cannot make ranged attacks, -2 dice on melee attacks, cannot use abilities requiring line of sight, move at half speed. An adjacent ally may use an action to clean ink/flash from a Blinded unit (removes Blinded status). Rain or water terrain immediately removes Blinded."
    },
    {
      "name": "Explosive",
      "effect": "On hit, all models within 3\" take 1 automatic hit"
    },
    {
      "name": "Grapple",
      "effect": "On hit, pull target 3-6\" toward this unit. Target may not move next activation"
    },
    {
      "name": "Ignores Cover",
      "effect": "Attacks from this weapon ignore cover bonuses to Defense"
    },
    {
      "name": "Pinning Shot",
      "effect": "Target hit may not move next activation"
    },
    {
      "name": "Quake",
      "effect": "All models within 6\" must pass Quality test or become Pinned"
    },
    {
      "name": "Rapid Fire",
      "effect": "May split attack dice between multiple targets within range"
    },
    {
      "name": "Sonic",
      "effect": "Ignores Heavy Armor bonus. Ignores cover bonuses to Defense. If at least 1 damage dealt, target tests Morale."
    },
    {
      "name": "Thrown 6 inches",
      "effect": "May be thrown up to 6\" as ranged attack, then used in melee"
    },
    {
      "name": "Thrown 8 inches",
      "effect": "May be thrown up to 8\" as ranged attack, then used in melee"
    }
  ],
  "type_rules": [
    {
      "type": "Grunt",
      "name": "Expendable Fodder",
      "effect": "Do not grant Victory Points when destroyed. Do not generate Morale Loss when destroyed. May contest objectives even if outnumbered, but never control them. Destroyed Frail do not count toward activation advantage."
    },
    {
      "type": "Brute",
      "name": "Momentum",
      "effect": "After inflicting at least 1 damage in melee, this unit may immediately move up to 2\". This movement does not trigger reactions. This movement may not end in base contact with an enemy."
    },
    {
      "type": "Mystic",
      "name": "Lingering Harm",
      "effect": "Debuffs applied by this unit persist until the end of the target's next activation."
    },
    {
      "type": "Shooter",
      "name": "Fire Superiority",
      "effect": "If this unit did not move this activation, it may split its attack dice between up to two valid targets."
    },
    {
      "type": "Shooter",
      "name": "Suppression Fragility",
      "effect": "If this unit is Pinned or Grappled, it may not use Critical Damage abilities this activation."
    },
    {
      "type": "Cavalry",
      "name": "Disengage",
      "effect": "After resolving an attack, this unit may disengage from melee without suffering penalties or free strikes."
    },
    {
      "type": "Rogue",
      "name": "First Strike",
      "effect": "When charged or charging, this unit attacks first. If both units have First Strike, resolve simultaneously."
    },
    {
      "type": "Tank",
      "name": "Bodyguard",
      "effect": "May intercept attacks targeting adjacent friendly units. Roll Defense for intercepted attack."
    },
    {
      "type": "Titan",
      "name": "Unstoppable",
      "effect": "Ignores difficult terrain. Cannot be Grappled or Pinned by units smaller than Brute."
    },
    {
      "type": "Leader",
      "name": "Rally",
      "effect": "Once per round, may grant an ally within 12\" +1 die on their next Morale test."
    },
    {
      "type": "Leader",
      "name": "Command Presence",
      "effect": "Friendly units within 6\" may use this unit's Quality for Morale tests instead of their own (if higher)."
    },
    {
      "type": "Leader",
      "name": "High-Value Target",
      "effect": "If this unit is destroyed, enemy gains +2 VP."
    }
  ],
  "universal_upgrades": {
    "protective_gear": [
      {
        "name": "Gas Mask",
        "cost": 3,
        "effect": "Protective eyewear and respirator. Immune to Coffin Cough environmental penalty and Blinding effects (like Ink Bomb)."
      }
    ],
    "armor": [
      {
        "name": "Witch-Stitched",
        "cost": 2,
        "effect": "Magical armor woven into clothing. Grants Heavy Armor (+2 Defense dice) with no movement penalty. Available to those trained by or allied with Conjure Guard mystics."
      }
    ],
    "vehicle_upgrades": [
      {
        "name": "Reinforced Cab",
        "cost": 3,
        "effect": "Armored plating. +1 Defense, -1\" Move."
      },
      {
        "name": "Extra Storage",
        "cost": 5,
        "effect": "Additional cargo rigging. Increase capacity by +2 small monsters OR +1 objective."
      }
    ],
    "mechanic_tools": [
      {
        "name": "Spare Parts",
        "cost": 5,
        "effect": "Carry field supplies. +1 use of Repair ability per game."
      }
    ],
    "consumables": [
      {
        "name": "Pocket Snacks",
        "cost": 5,
        "type": "Gear",
        "effect": "Once per game, when this unit attempts a Befriend action against a creature of a Monster Type it is trained to Befriend, it may use Pocket Snacks. Using Pocket Snacks consumes the item immediately. The Befriend attempt is delayed: Round 1 is spent feeding, placating, or preparing the creature. In Round 2, resolve the Befriend roll normally. If the result is a tie, treat it as a win for the Ranger. Pocket Snacks have no effect on Peerless creatures."
      }
    ]
  },
  "wild_magic_table": {
    "name": "Wild Magic Table",
    "description": "Roll 2d6 when using Unleashed Power. Used by Mystics and magic-wielding units.",
    "results": [
      {
        "roll": 2,
        "name": "Catastrophic Backfire",
        "effect": "Caster takes 2 damage and is Stunned. All allies within 3\" take 1 damage."
      },
      {
        "roll": 3,
        "name": "Wild Surge",
        "effect": "Target takes +1 damage. Roll again on this table (ignore further 3s)."
      },
      {
        "roll": 4,
        "name": "Unstable Discharge",
        "effect": "Target takes 1 damage. Caster takes 1 Strain."
      },
      {
        "roll": 5,
        "name": "Flickering Power",
        "effect": "Target takes 1 damage. Effect is delayed until next activation."
      },
      {
        "roll": 6,
        "name": "Controlled Release",
        "effect": "Target takes 2 damage normally."
      },
      {
        "roll": 7,
        "name": "Perfect Channeling",
        "effect": "Target takes 2 damage. No Strain on caster."
      },
      {
        "roll": 8,
        "name": "Empowered Strike",
        "effect": "Target takes 2 damage. Ignore armor/Defense bonuses."
      },
      {
        "roll": 9,
        "name": "Chain Lightning",
        "effect": "Target takes 2 damage. One adjacent enemy takes 1 damage."
      },
      {
        "roll": 10,
        "name": "Focused Blast",
        "effect": "Target takes 3 damage."
      },
      {
        "roll": 11,
        "name": "Crystal Resonance",
        "effect": "Target takes 3 damage. Caster may immediately Channel again at -1d6."
      },
      {
        "roll": 12,
        "name": "Thyr Overcharge",
        "effect": "Target takes 4 damage. All allies within 6\" gain +1 die on next action."
      }
    ]
  },
  "factions": [
    {
      "name": "Monsterology",
      "version": "1.1",
      "status": "complete",
      "data_file": "faction-monsterology.json",
      "composition_requirements": {
        "minimum_squabs": 2,
        "maximum_elders": 1,
        "suggested_max_velocipedes": 3
      },
      "faction_features": [
        {
          "name": "Dynamo Generator",
          "cost": 0,
          "required": true
        }
      ],
      "victory_objectives": [
        {
          "type": "Destroy Dynamo Generator",
          "vp": 10
        },
        {
          "type": "Destroy Iron Diplomat",
          "vp": 25
        }
      ]
    },
    {
      "name": "Monster Rangers",
      "version": "0.1",
      "status": "draft",
      "data_file": "faction-monsterrangers.json",
      "composition_requirements": {
        "minimum_core_rangers": 2,
        "maximum_vehicles": 1,
        "no_guns": true
      },
      "faction_features": [
        {
          "name": "Monster Escort",
          "cost": 0,
          "required": false,
          "effect": "Rangers gain bonus VP for successfully escorting Monsters to safety"
        }
      ],
      "victory_objectives": [
        {
          "type": "Escort Monster to Safety",
          "vp": 15
        },
        {
          "type": "Protect Cargo Tiger",
          "vp": 10
        }
      ]
    },
    {
      "name": "Agency M",
      "version": "0.1",
      "status": "draft",
      "data_file": "faction-agencym.json",
      "composition_requirements": {
        "minimum_units": 3,
        "maximum_titans": 2,
        "maximum_black_mariah": 1
      },
      "faction_features": [
        {
          "name": "Arrest and Extract",
          "cost": 0,
          "required": false,
          "effect": "Agency M scores VP by arresting (via Binding Rig) and extracting units via Black Mariah"
        }
      ],
      "victory_objectives": [
        {
          "type": "Extract Arrested Units",
          "vp": "Point cost ÷ 10 per unit"
        },
        {
          "type": "Protect Black Mariah",
          "vp": 10
        }
      ]
    },
    {
      "name": "Shine Riders",
      "version": "1.0",
      "status": "playtesting",
      "data_file": "faction-shine-riders.json",
      "composition_requirements": {
        "note": "Extraction-focused faction. Build for speed and survivability, not prolonged combat."
      },
      "faction_features": [
        {
          "name": "Extraction Specialists",
          "cost": 0,
          "required": true,
          "effect": "All Shine Riders units gain +1 die when performing Interact actions to extract Thyr or turn buildings."
        },
        {
          "name": "Quick Exit",
          "cost": 0,
          "required": true,
          "effect": "Shine Riders units within 6\" of a table edge gain +1 to Disengage rolls."
        },
        {
          "name": "Silver Rush",
          "cost": 0,
          "required": true,
          "effect": "Earn bonus Silver for each building successfully turned and held until end of game."
        }
      ],
      "victory_objectives": [
        {
          "type": "Building Extraction",
          "vp": 2,
          "description": "Control a turned building at end of game"
        },
        {
          "type": "Thyr Cache",
          "vp": 3,
          "description": "Successfully extract and hold 3+ Thyr crystals"
        },
        {
          "type": "Clean Getaway",
          "vp": 1,
          "description": "End game with all units within 6\" of table edge (minimum 3 units surviving)"
        }
      ]
    }
  ],
  "universal_weapons": {
    "melee_and_thrown": [
      {
        "name": "Hatchet",
        "range": null,
        "properties": [
          "Thrown 8 inches"
        ],
        "description": "Versatile tool and weapon. Can be thrown or used in melee. Used extensively by Monster Rangers, lumberjacks, and frontier fighters."
      },
      {
        "name": "Heavy Hatchet",
        "range": null,
        "properties": [
          "Thrown 6 inches",
          "AP 1"
        ],
        "description": "Heavier throwing axe with armor-piercing capability but shorter range."
      }
    ]
  }
}    
  ]
}
